Documents/Renault_CRM_ЗаявкаНаПодменныйАвто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_CRM_ЗаявкаНаПодменныйАвто</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машиноместо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЧерновикиАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упущена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидыСостоянийДокументовАвтосервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИзменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ТарифНаКомплектацииАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТарифНаКомплектацииАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаКлиентская</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаДилерская</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоступноКЗаказуВПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенКорпКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТарифыНаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГодПТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Renault_CRM_ЗаявкаНаПодменныйАвто/Ext/ManagerModule.bsl
Функция ПолучитьДанныеПечати(Знач МассивДокументов, Знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	    
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка, ИмяМакета));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие; 	
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект, ИмяМакета)
	//Козлов Е.А. Начало 10.11.2016
	МетаданныеСтрока = "Контрагенты";
	Если ТипЗнч(СсылкаНаОбъект.Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") Тогда
		МетаданныеСтрока = "CRM_ПотенциальныеКонтрагенты";
	КонецЕсли;  
	
	//DMSREN-1335 добавил в запрос птс и стс
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	Организации.ИНН КАК ОрганизацияИНН,
	|	Организации.КПП КАК ОрганизацияКПП,
	|	Организации.ОсновнойБанковскийСчет КАК ОрганизацияОсновнойБанковскийСчет,
	|	Организации.ОсновнойБанковскийСчет.Банк КАК ОрганизацияБанк,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК ОрганизацияКоррСчет,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК ОрганизацияБИК,
	|	КонтактнаяИнформацияРег.Представление КАК ОрганизацияАдресФактический
	|ПОМЕСТИТЬ ДанныеОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияРег
	|		ПО Организации.Ссылка = КонтактнаяИнформацияРег.Объект
	|			И (КонтактнаяИнформацияРег.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияРег.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Номер КАК НомерЗаявки,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Дата КАК ДатаЗаявки,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Клиент,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.ДилерскийЦентр.ОсновнойАдрес КАК АдресДилерскогоЦентра,
	|	ВЫБОР
	|		КОГДА Renault_CRM_ЗаявкаНаПодменныйАвто.Клиент ССЫЛКА Справочник." + МетаданныеСтрока + "
	|			ТОГДА ВЫРАЗИТЬ(Renault_CRM_ЗаявкаНаПодменныйАвто.Клиент КАК Справочник." + МетаданныеСтрока + ").Наименование
	|	КОНЕЦ КАК КлиентНаименование,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.ВремяНачала,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.ВремяОкончания,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Машиноместо,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Автор.Сотрудник КАК Сотрудник,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Автор.Сотрудник.Наименование КАК СотрудникНаименование,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Машиноместо.Автомобиль,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Машиноместо.Автомобиль.Модель,
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Машиноместо.Автомобиль.ВариантКомплектации
	|ПОМЕСТИТЬ ДанныеЗаявки
	|ИЗ
	|	Документ.Renault_CRM_ЗаявкаНаПодменныйАвто КАК Renault_CRM_ЗаявкаНаПодменныйАвто
	|ГДЕ
	|	Renault_CRM_ЗаявкаНаПодменныйАвто.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеЗаявки.Клиент ССЫЛКА Справочник." + МетаданныеСтрока + "
	|			ТОГДА ВЫРАЗИТЬ(ДанныеЗаявки.Клиент КАК Справочник." + МетаданныеСтрока + ").Ссылка
	|	КОНЕЦ КАК Клиент
	|ПОМЕСТИТЬ КлиентИзЗаявки
	|ИЗ
	|	ДанныеЗаявки КАК ДанныеЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление КАК ТелефонКлиента,
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник." + МетаданныеСтрока + "
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник." + МетаданныеСтрока + ").Ссылка
	|	КОНЕЦ КАК Клиент
	|ПОМЕСТИТЬ ТелефонКлиентаТЗ
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект В
	|			(ВЫБРАТЬ
	|				КлиентИзЗаявки.Клиент
	|			ИЗ
	|				КлиентИзЗаявки КАК КлиентИзЗаявки)
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК АдресКлиента,
	|	КонтактнаяИнформация.Поле4 КАК ГородКлиента,
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Объект ССЫЛКА Справочник." + МетаданныеСтрока + "
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник." + МетаданныеСтрока + ").Ссылка
	|	КОНЕЦ КАК Клиент
	|ПОМЕСТИТЬ АдресКлиентаТЗ
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект В
	|			(ВЫБРАТЬ
	|				КлиентИзЗаявки.Клиент
	|			ИЗ
	|				КлиентИзЗаявки КАК КлиентИзЗаявки)
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА ПодтверждающиеДокументы.Владелец ССЫЛКА Справочник." + МетаданныеСтрока + "
	|			ТОГДА ВЫРАЗИТЬ(ПодтверждающиеДокументы.Владелец КАК Справочник." + МетаданныеСтрока + ").Ссылка
	|	КОНЕЦ КАК Клиент,
	|	ПодтверждающиеДокументы.Серия КАК ПаспортСерия,
	|	ПодтверждающиеДокументы.Номер КАК ПаспортНомер,
	|	ПодтверждающиеДокументы.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан КАК ПаспортКемВыдан
	|ПОМЕСТИТЬ ПаспортныеДанныеКлиент
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец В
	|			(ВЫБРАТЬ
	|				КлиентИзЗаявки.Клиент
	|			ИЗ
	|				КлиентИзЗаявки КАК КлиентИзЗаявки)
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт)
	|	И ПодтверждающиеДокументы.Текущий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА ПодтверждающиеДокументы.Владелец ССЫЛКА Справочник." + МетаданныеСтрока + "
	|			ТОГДА ВЫРАЗИТЬ(ПодтверждающиеДокументы.Владелец КАК Справочник." + МетаданныеСтрока + ").Ссылка
	|	КОНЕЦ КАК Клиент,
	|	ПодтверждающиеДокументы.Серия КАК ВУСерия,
	|	ПодтверждающиеДокументы.Номер КАК ВУНомер,
	|	ПодтверждающиеДокументы.ДатаВыдачи КАК ВУДатаВыдачи
	|ПОМЕСТИТЬ ВУДанныеКлиент
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец В
	|			(ВЫБРАТЬ
	|				КлиентИзЗаявки.Клиент
	|			ИЗ
	|				КлиентИзЗаявки КАК КлиентИзЗаявки)
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Удостоверение)
	|	И ПодтверждающиеДокументы.Текущий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_CRM_ПодменныеАвто.Автомобиль.Модель.Наименование КАК МодельВыданногоАвто,
	|	Renault_CRM_ПодменныеАвто.Автомобиль.ГодВыпуска КАК ГодВыпускаВыданногоАвто,
	|	Renault_CRM_ПодменныеАвто.Автомобиль.НомерДвигателя КАК НомерДвигателяВыданногоАвто,
	|	Renault_CRM_ПодменныеАвто.Автомобиль.НомерКузова КАК НомерКузоваВыданногоАвто,
	|	Renault_CRM_ПодменныеАвто.Автомобиль.ТипДвигателя.Наименование КАК МодельДвигателяВыданногоАвто,
	|	Renault_CRM_ПодменныеАвто.Автомобиль.Цвет.Наименование КАК ЦветВыданногоАвто,
	|	Renault_CRM_ПодменныеАвто.Автомобиль.VIN КАК VINВыданногоАвто,
	|	Renault_CRM_ПодменныеАвто.Ссылка КАК ПодменныйАвтомобиль
	|ПОМЕСТИТЬ ДанныеПодменногоАвто
	|ИЗ
	|	Справочник.Renault_CRM_ПодменныеАвто КАК Renault_CRM_ПодменныеАвто
	|ГДЕ
	|	Renault_CRM_ПодменныеАвто.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеЗаявки.Машиноместо
	|			ИЗ
	|				ДанныеЗаявки КАК ДанныеЗаявки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	CRM_МаркаАвтомобиляМоделиАвтомобилей.Ссылка.Наименование КАК МаркаАвтомобиля,
	|	CRM_МаркаАвтомобиляМоделиАвтомобилей.Модель
	|ПОМЕСТИТЬ МаркаВыданогоАвто
	|ИЗ
	|	Справочник.CRM_МаркаАвтомобиля.МоделиАвтомобилей КАК CRM_МаркаАвтомобиляМоделиАвтомобилей
	|ГДЕ
	|	CRM_МаркаАвтомобиляМоделиАвтомобилей.Модель В
	|			(ВЫБРАТЬ
	|				ДанныеЗаявки.МашиноместоАвтомобильМодель
	|			ИЗ
	|				ДанныеЗаявки КАК ДанныеЗаявки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвтомобилиСрезПоследних.Автомобиль,
	|	АвтомобилиСрезПоследних.Значение КАК ГосНомер
	|ПОМЕСТИТЬ ГосНомерПодменногоАвтомобиля
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	|ГДЕ
	|	АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)
	|	И АвтомобилиСрезПоследних.Автомобиль В
	|			(ВЫБРАТЬ
	|				ДанныеЗаявки.МашиноместоАвтомобиль
	|			ИЗ
	|				ДанныеЗаявки КАК ДанныеЗаявки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ПодтверждающиеДокументы.Владелец ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ВЫРАЗИТЬ(ПодтверждающиеДокументы.Владелец КАК Справочник.Сотрудники).Ссылка
	|	КОНЕЦ КАК Сотрудник
	|ПОМЕСТИТЬ ДоверенностьСотрудника
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец В
	|			(ВЫБРАТЬ
	|				ДанныеЗаявки.Сотрудник
	|			ИЗ
	|				ДанныеЗаявки КАК ДанныеЗаявки)
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Доверенность)
	|	И ПодтверждающиеДокументы.Текущий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.Модель,
	|	Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ВариантКомплектации,
	|	ВЫРАЗИТЬ(Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ЦенаКлиентская КАК ЧИСЛО(15, 2)) КАК ЦенаКлиентская,
	|	ВЫРАЗИТЬ(Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних.ЦенаКлиентская * &НДС / (100 + &НДС) КАК ЧИСЛО(15, 2)) КАК СуммаНДС
	|ПОМЕСТИТЬ ЦенаКлиентскаяМодель
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаКомплектацииАвтомобилей.СрезПоследних(
	|			,
	|			(Модель, ВариантКомплектации) В
	|					(ВЫБРАТЬ
	|						ДанныеЗаявки.МашиноместоАвтомобильМодель,
	|						ДанныеЗаявки.МашиноместоАвтомобильВариантКомплектации
	|					ИЗ
	|						ДанныеЗаявки КАК ДанныеЗаявки)
	|				И Тариф = &ТекущийТариф) КАК Renault_ТарифНаКомплектацииАвтомобилейСрезПоследних
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ          
	|Renault_ДоговорСоставДоговора.ПТС КАК ПТС,
	|Renault_ДоговорСоставДоговора.Модель КАК Модель,
	|Renault_ДоговорСоставДоговора.Версия КАК Версия,
	|Renault_ДоговорСоставДоговора.VIN КАК VIN
	|Поместить СоставДоговора
	|ИЗ
	|Документ.Renault_Договор.СоставДоговора КАК Renault_ДоговорСоставДоговора
	|ГДЕ
	|    Renault_ДоговорСоставДоговора.VIN В
	|         (ВЫБРАТЬ 
	|              ДанныеПодменногоАвто.VINВыданногоАвто
	|          ИЗ
	|              ДанныеПодменногоАвто КАК ДанныеПодменногоАвто)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|ПодтверждающиеДокументы.Владелец КАК Клиент,
	|ПодтверждающиеДокументы.Серия КАК ПаспортСерия,
	|ПодтверждающиеДокументы.Номер КАК ПаспортНомер,
	|ПодтверждающиеДокументы.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|ПодтверждающиеДокументы.КемВыдан КАК ПаспортКемВыдан,
	|ПодтверждающиеДокументы.Наименование КАК СТС
	|ПОМЕСТИТЬ ПаспортныеДанныеАвтомобиля
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец.VIN В
	|			(ВЫБРАТЬ
	|				ДанныеПодменногоАвто.VINВыданногоАвто
	|			ИЗ
	|				ДанныеПодменногоАвто КАК ДанныеПодменногоАвто)
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Свидетельство)
	|	И ПодтверждающиеДокументы.Текущий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДоверенностьСотрудника.Номер, """") КАК ДоверенностьНомер,
	|	ЕСТЬNULL(ДоверенностьСотрудника.ДатаВыдачи, """") КАК ДоверенностьДата,
	|	ЕСТЬNULL(ПаспортныеДанныеКлиент.ПаспортСерия, """") КАК ПаспортКлиентаСерия,
	|	ЕСТЬNULL(ПаспортныеДанныеКлиент.ПаспортНомер, """") КАК ПаспортКлиентаНомер,
	|	ЕСТЬNULL(ПаспортныеДанныеКлиент.ПаспортДатаВыдачи, """") КАК ПаспортКлиентаДатаВыдачи,
	|	ЕСТЬNULL(ПаспортныеДанныеКлиент.ПаспортКемВыдан, """") КАК ПаспортКлиентаКемВыдан,
	|	ЕСТЬNULL(ТелефонКлиентаТЗ.ТелефонКлиента, """") КАК ТелефонКлиента,
	|	ЕСТЬNULL(АдресКлиентаТЗ.АдресКлиента, """") КАК АдресКлиента,
	|	ЕСТЬNULL(АдресКлиентаТЗ.ГородКлиента, """") КАК ГородКлиента,
	|	ЕСТЬNULL(ВУДанныеКлиент.ВУСерия, """") КАК ВУСерия,
	|	ЕСТЬNULL(ВУДанныеКлиент.ВУНомер, """") КАК ВУНомер,
	|	ЕСТЬNULL(ВУДанныеКлиент.ВУДатаВыдачи, """") КАК ВУДатаВыдачи,
	|	ЕСТЬNULL(ДанныеПодменногоАвто.МодельВыданногоАвто, """") КАК МодельВыданногоАвто,
	|	ЕСТЬNULL(ДанныеПодменногоАвто.ГодВыпускаВыданногоАвто, """") КАК ГодВыпускаВыданногоАвто,
	|	ЕСТЬNULL(ДанныеПодменногоАвто.НомерДвигателяВыданногоАвто, """") КАК НомерДвигателяВыданногоАвто,
	|	ЕСТЬNULL(ДанныеПодменногоАвто.НомерКузоваВыданногоАвто, """") КАК НомерКузоваВыданногоАвто,
	|	ЕСТЬNULL(ДанныеПодменногоАвто.МодельДвигателяВыданногоАвто, """") КАК МодельДвигателяВыданногоАвто,
	|	ЕСТЬNULL(ДанныеПодменногоАвто.ЦветВыданногоАвто, """") КАК ЦветВыданногоАвто,
	|	ЕСТЬNULL(ДанныеПодменногоАвто.VINВыданногоАвто, """") КАК VINВыданногоАвто,
	|	ЕСТЬNULL(МаркаВыданогоАвто.МаркаАвтомобиля, """") КАК МаркаВыданногоАвто,
	|	ЕСТЬNULL(ГосНомерПодменногоАвтомобиля.ГосНомер, """") КАК ГосНомерВыданногоАвто,
	|	ЕСТЬNULL(ЦенаКлиентскаяМодель.ЦенаКлиентская, """") КАК ЦенаКлиентская,
	|	ЕСТЬNULL(ЦенаКлиентскаяМодель.СуммаНДС, """") КАК СуммаНДС,
	|	ДанныеЗаявки.НомерЗаявки КАК НомерЗаявки,
	|	ДанныеЗаявки.ДатаЗаявки КАК ДатаЗаявки,
	|	ДанныеЗаявки.КлиентНаименование КАК КлиентФИО,
	|	ДанныеЗаявки.ВремяНачала КАК ДатаПолучения,
	|	ДанныеЗаявки.ВремяОкончания КАК ДатаВыдачи,
	|	ДанныеЗаявки.СотрудникНаименование КАК Мастер,
	|	ДанныеЗаявки.АдресДилерскогоЦентра КАК АдресДилерскогоЦентра,
	|	ДанныеОрганизации.ОрганизацияНаименованиеПолное КАК Организация,
	|	ДанныеОрганизации.ОрганизацияИНН КАК ОрганизацияИНН,
	|	ДанныеОрганизации.ОрганизацияКПП КАК ОрганизацияКПП,
	|	ДанныеОрганизации.ОрганизацияОсновнойБанковскийСчет КАК ОрганизацияСчет,
	|	ЕСТЬNULL(ДанныеОрганизации.ОрганизацияБанк, """") КАК ОрганизацияБанк,
	|	ЕСТЬNULL(ДанныеОрганизации.ОрганизацияКоррСчет, """") КАК ОрганизацияКоррСчет,
	|	ЕСТЬNULL(ДанныеОрганизации.ОрганизацияБИК, """") КАК ОрганизацияБИК,
	|	ЕСТЬNULL(ДанныеОрганизации.ОрганизацияАдресФактический, """") КАК ОрганизацияАдресФактический,
	|   ЕСТЬNULL(СоставДоговора.ПТС, """") КАК ПТС,
	|   ЕСТЬNULL(ПаспортныеДанныеАвтомобиля.СТС, """") КАК СТС
	|ИЗ  
	|	ДанныеЗаявки КАК ДанныеЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПаспортныеДанныеКлиент КАК ПаспортныеДанныеКлиент
	|		ПО ДанныеЗаявки.Клиент = ПаспортныеДанныеКлиент.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефонКлиентаТЗ КАК ТелефонКлиентаТЗ
	|		ПО ДанныеЗаявки.Клиент = ТелефонКлиентаТЗ.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресКлиентаТЗ КАК АдресКлиентаТЗ
	|		ПО ДанныеЗаявки.Клиент = АдресКлиентаТЗ.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВУДанныеКлиент КАК ВУДанныеКлиент
	|		ПО ДанныеЗаявки.Клиент = ВУДанныеКлиент.Клиент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПодменногоАвто КАК ДанныеПодменногоАвто
	|		ПО ДанныеЗаявки.Машиноместо = ДанныеПодменногоАвто.ПодменныйАвтомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаркаВыданогоАвто КАК МаркаВыданогоАвто
	|		ПО ДанныеЗаявки.МашиноместоАвтомобильМодель = МаркаВыданогоАвто.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГосНомерПодменногоАвтомобиля КАК ГосНомерПодменногоАвтомобиля
	|		ПО ДанныеЗаявки.МашиноместоАвтомобиль = ГосНомерПодменногоАвтомобиля.Автомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоверенностьСотрудника КАК ДоверенностьСотрудника
	|		ПО ДанныеЗаявки.Сотрудник = ДоверенностьСотрудника.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаКлиентскаяМодель КАК ЦенаКлиентскаяМодель
	|		ПО ДанныеЗаявки.МашиноместоАвтомобильМодель = ЦенаКлиентскаяМодель.Модель
	|			И ДанныеЗаявки.МашиноместоАвтомобильВариантКомплектации = ЦенаКлиентскаяМодель.ВариантКомплектации
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеОрганизации КАК ДанныеОрганизации
	|		ПО (ИСТИНА),
	|       СоставДоговора КАК СоставДоговора,
	|       ПаспортныеДанныеАвтомобиля";
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Ссылка,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.ВерсияДанных,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.ПометкаУдаления,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Номер,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Дата,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Проведен,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.ДилерскийЦентр,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Автор,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Клиент,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.ВремяНачала,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.ВремяОкончания,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Машиноместо,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.ГосНомер,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Автомобиль,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Упущена,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Обращение,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Длительность,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Состояние,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Примечание,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.СостояниеИзменено,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.ХозОперация,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Платная,
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Стоимость
	//               |ИЗ
	//               |	Документ.Renault_CRM_ЗаявкаНаПодменныйАвто КАК Renault_CRM_ЗаявкаНаПодменныйАвто
	//               |ГДЕ
	//               |	Renault_CRM_ЗаявкаНаПодменныйАвто.Ссылка = &Ссылка";				   
	ТекущийТариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили(); 
	
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.Организация);
	Запрос.УстановитьПараметр("ТекущийТариф", ТекущийТариф);
	Запрос.УстановитьПараметр("НДС", Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.Ставка); 
	
	//Козлов Е.А Конец
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеОбъекта = Новый Структура;
	
	Для каждого ТекущаяКолонка Из РезультатЗапроса.Колонки Цикл
		ДанныеОбъекта.Вставить(ТекущаяКолонка.Имя);
	КонецЦикла; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта,Выборка);
		
		//Козлов Е.А. Начало 11.11.2016
		ДанныеОбъекта.Вставить("ДатаЗаявки", ?(НЕ ЗначениеЗаполнено(Выборка.ДатаЗаявки), Выборка.ДатаЗаявки, Формат(Выборка.ДатаЗаявки, "ДФ=dd.MM.yyyy"))); 
		ДанныеОбъекта.Вставить("ДоверенностьДата", ?(НЕ ЗначениеЗаполнено(Выборка.ДоверенностьДата), Выборка.ДоверенностьДата, Формат(Выборка.ДоверенностьДата, "ДФ=dd.MM.yyyy"))); 
		ДанныеОбъекта.Вставить("ПаспортКлиентаДатаВыдачи", ?(НЕ ЗначениеЗаполнено(Выборка.ПаспортКлиентаДатаВыдачи), Выборка.ПаспортКлиентаДатаВыдачи, Формат(Выборка.ПаспортКлиентаДатаВыдачи, "ДФ=dd.MM.yyyy"))); 
		ДанныеОбъекта.Вставить("ГодВыпускаВыданногоАвто", ?(НЕ ЗначениеЗаполнено(Выборка.ГодВыпускаВыданногоАвто), Выборка.ГодВыпускаВыданногоАвто, Формат(Выборка.ГодВыпускаВыданногоАвто, "ДФ=yyyy"))); 
		ДанныеОбъекта.Вставить("ВУДатаВыдачи", ?(НЕ ЗначениеЗаполнено(Выборка.ВУДатаВыдачи), Выборка.ВУДатаВыдачи, Формат(Выборка.ВУДатаВыдачи, "ДФ=dd.MM.yyyy"))); 
		ДанныеОбъекта.Вставить("ДатаПолучения", ?(НЕ ЗначениеЗаполнено(Выборка.ДатаПолучения), Выборка.ДатаПолучения, Формат(Выборка.ДатаПолучения, "ДФ=dd.MM.yyyy"))); 
		ДанныеОбъекта.Вставить("ДатаВыдачи", ?(НЕ ЗначениеЗаполнено(Выборка.ДатаВыдачи), Выборка.ДатаВыдачи, Формат(Выборка.ДатаВыдачи, "ДФ=dd.MM.yyyy"))); 
		ДанныеОбъекта.Вставить("ВремяПолучения", ?(НЕ ЗначениеЗаполнено(Выборка.ДатаПолучения), Выборка.ДатаПолучения, Формат(Выборка.ДатаПолучения, "ДФ=HH:mm"))); 
		ДанныеОбъекта.Вставить("ВремяВыдачи", ?(НЕ ЗначениеЗаполнено(Выборка.ДатаВыдачи), Выборка.ДатаВыдачи, Формат(Выборка.ДатаВыдачи, "ДФ=HH:mm"))); 
		
		ДанныеОбъекта.Вставить("СтоимостьВыданногоАвто", ?(НЕ ЗначениеЗаполнено(Выборка.ЦенаКлиентская), Выборка.ЦенаКлиентская, "" + Выборка.ЦенаКлиентская + " руб. в т.ч. НДС - " + Выборка.СуммаНДС + " руб.")); 
		
		ДанныеОбъекта.Вставить("НомерЗаявки", ОбрезатьЛишниеСимволы(Выборка.НомерЗаявки));
		ДанныеОбъекта.Вставить("ПТС", Выборка.ПТС); //DMSREN-1335
		ДанныеОбъекта.Вставить("СТС", Выборка.СТС); //DMSREN-1335

		//Козлов Е.А. Конец
	КонецЕсли; 
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	Renault_УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

//Козлов Е.А. Начало 11.11.2016
Функция ОбрезатьЛишниеСимволы(НачальныйНомер)
	СтрокаЭталон = "123456789";
	
	ДлинаСтроки = СтрДлина(НачальныйНомер);
	
	КонечныйНомер = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		ТекущийСимвол = Сред(НачальныйНомер, Счетчик, 1);
		
		Если СтрЧислоВхождений(СтрокаЭталон, ТекущийСимвол) <> 0 Тогда
			КонечныйНомер = Прав(НачальныйНомер, ДлинаСтроки - Счетчик + 1);
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат ?(ЗначениеЗаполнено(КонечныйНомер), КонечныйНомер, НачальныйНомер);	
КонецФункции
//Козлов Е.А. Конец
